ja/CONTRIBUTING.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-02-26 Mon 06:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to contribute to Linux Commands</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="How to contribute to Linux Commands - Linuxコマンド">
<meta name="description" content="">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="How to contribute to Linux Commands - Linuxコマンド">
<meta property="og:description" content="">
<meta name="twitter:title" content="How to contribute to Linux Commands - Linuxコマンド">
<meta name="twitter:description" content="">
</head>
<body>
<div id="content">
<h1 class="title">How to contribute to Linux Commands</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ff1a31">What is benefit of this project?</a></li>
<li><a href="#orge7fa9e4">Please share your knowledge</a></li>
<li><a href="#org60c3168">What should I know to contribute?</a></li>
<li><a href="#org248b550">Contributing with your native language</a></li>
<li><a href="#org7cbeb55">Writing document</a></li>
<li><a href="#org67a6a54">Commit rules</a>
<ul>
<li><a href="#org59a549c">prefixes</a></li>
</ul>
</li>
<li><a href="#org9d25134">Macros</a>
<ul>
<li><a href="#org5ed8fdd">Inline</a>
<ul>
<li><a href="#org390ff90">Related image</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9ff1a31" class="outline-2">
<h2 id="org9ff1a31">What is benefit of this project?</h2>
<div class="outline-text-2" id="text-org9ff1a31">
<p>
This project is made for documentation of all programs we use.
And all of documents are <a href="./STANDARD.html">standardized</a> and have a clearfied sections.
</p>

<p>
Think about when you search for the information of Linux commands.
Your needs are just simple, but maybe you should be searching the internet for wasting times.
It will reduce your productivility and concentration.
</p>

<p>
This project focused on improving your productivility and preserving concentration.
You don't need to search for another web sites to get an information and don't have to confuse because of new sections or UI.
Only you need is familiar about one unified sections and UI!
</p>

<p>
And it is opensource, that means, all of docs are yours!
</p>
</div>
</div>

<div id="outline-container-orge7fa9e4" class="outline-2">
<h2 id="orge7fa9e4">Please share your knowledge</h2>
<div class="outline-text-2" id="text-orge7fa9e4">
<p>
This project need your help to grow up.
Meaning of contributing on this project is that creating your own knowledge base and share your wisdom with community.
Your name will be recorded in what you contributed documents if you want, and people will thank of your contributions.
</p>
</div>
</div>

<div id="outline-container-org60c3168" class="outline-2">
<h2 id="org60c3168">What should I know to contribute?</h2>
<div class="outline-text-2" id="text-org60c3168">
<p>
First of all, you should know about <b>Org Mode</b>.
If you know about the Markdown syntax, It will be easier.
Or not, also easy to use and if you will be accustomed, you maybe love it.
</p>

<p>
It is builtin mode of Emacs, but it isn't that means only Emacs users can be use it.
You can use with your favorite editor, evenif text editor or github file editor.
</p>

<p>
Here is tutorial for Org Mode. Don't be afraid, I think, It might be the editor what you look for.
</p>
<ul class="org-ul">
<li><a href="https://orgmode.org/manual/index.html">Offical manual</a></li>
<li><a href="https://github.com/fniessen/refcard-org-mode">refcard-org-mode</a></li>
</ul>

<p>
Also see <a href="./org-mode.html">org-mode document</a>
</p>
</div>
</div>

<div id="outline-container-org248b550" class="outline-2">
<h2 id="org248b550">Contributing with your native language</h2>
<div class="outline-text-2" id="text-org248b550">
<p>
You shouldn't have to use only English. It's up to you.
In fact, we need more contribution of your native language.
</p>

<p>
This project deploys the contents automatically splited by languages.
Only contributing one file, It will be split 5 files with English, Spanish, Korean, Chinese and Japanese(currently support).
</p>

<p>
And here is the distributed contents currently working.
</p>
<ul class="org-ul">
<li><a href="http://linux-command.org/en">English</a></li>
<li><a href="http://linux-command.org/es">Español</a></li>
<li><a href="http://linux-command.org/ko">한국어</a></li>
<li><a href="http://linux-command.org/zh">中文</a></li>
<li><a href="http://linux-command.org/ja">日本語</a></li>
</ul>

<p>
You want to new language? It's a piece of cake.
Just add lang code with newline in the <a href="./.supportLanguages">supportLanguages</a> file.
</p>

<p>
You can add your language simply using "#+LANG_XX:" keyword.
Also section type, block type or emphasis type are currently supported.
Here is detail usage of the multilingual keywords on <a href="https://github.com/mrlee23/org-multilingual">here</a>.
</p>
</div>
</div>

<div id="outline-container-org7cbeb55" class="outline-2">
<h2 id="org7cbeb55">Writing document</h2>
<div class="outline-text-2" id="text-org7cbeb55">
<p>
All of documents sections are standardized depending on <a href="./STANDARD.html">STANDARD template</a>.
Only the section which exists in the standard file, should be used for keeping the unity.
And some sections have static form for more clearfy the meaning. (eg. Syntax - only use the code block to be shown quick usage)
</p>
</div>
</div>

<div id="outline-container-org67a6a54" class="outline-2">
<h2 id="org67a6a54">Commit rules</h2>
<div class="outline-text-2" id="text-org67a6a54">
</div><div id="outline-container-org59a549c" class="outline-3">
<h3 id="org59a549c">prefixes</h3>
<div class="outline-text-3" id="text-org59a549c">
<ul class="org-ul">
<li>Macro : Relate org macros.</li>
<li>Elisp : Relate linux-commands.el</li>
<li>En, Es, Ko, Zh, Ja, ... : Relate language with org document of Linux Commands.</li>
<li>CI/CD : Modified .travis.yml, Makefile and linux-commands-pages.el</li>
<li>Pages : Modifications of assets.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9d25134" class="outline-2">
<h2 id="org9d25134">Macros</h2>
<div class="outline-text-2" id="text-org9d25134">
</div><div id="outline-container-org5ed8fdd" class="outline-3">
<h3 id="org5ed8fdd">Inline</h3>
<div class="outline-text-3" id="text-org5ed8fdd">
<ul class="org-ul">
<li>REDIRECT(string location)</li>
<li>VERSION(string version)</li>
<li>LATEST_VERSION(string version)</li>
<li>BUILTIN</li>
<li>INCLUDE_PROGRESS</li>
<li>INCLUDE_DOCS</li>
<li>META</li>
</ul>
</div>

<div id="outline-container-org390ff90" class="outline-4">
<h4 id="org390ff90">Related image</h4>
<div class="outline-text-4" id="text-org390ff90">
<ul class="org-ul">
<li>IMAGE(string path, string name, string classes)</li>
<li>IMAGE_CENTER(string path, string name, string classes)</li>
<li>IMAGE_RIGHT(string path, string name, string classes)</li>
<li>IMAGE_MAIN(string name)</li>
<li>IMAGE_LINK(string path, string name, string classes)</li>
<li>IMAGE_LINK_CENTER(string path, string name, string classes)</li>
<li>IMAGE_LINK_RIGHT(string path, string name, string classes)</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-26</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-26 Mon 06:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
